HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEvadc_reg.h
/** \brief 3128, Queue 1 Status Register, Group 11 */
#define EVADC_G11_Q1_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0023128u)
/** Alias (User Manual Name) for EVADC_G11_Q1_QSR.
* To use register names with standard convension, please use EVADC_G11_Q1_QSR.
*/
#define EVADC_G11QSR1 (EVADC_G11_Q1_QSR)

/** \brief 312C, Queue 1 Register 0, Group 11 */
#define EVADC_G11_Q1_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002312Cu)
/** Alias (User Manual Name) for EVADC_G11_Q1_Q0R.
* To use register names with standard convension, please use EVADC_G11_Q1_Q0R.
*/
#define EVADC_G11Q0R1 (EVADC_G11_Q1_Q0R)

/** \brief 3130, Queue 1 Input Register, Group 11 */
#define EVADC_G11_Q1_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0023130u)
/** Alias (User Manual Name) for EVADC_G11_Q1_QINR.
* To use register names with standard convension, please use EVADC_G11_Q1_QINR.
*/
#define EVADC_G11QINR1 (EVADC_G11_Q1_QINR)

/** \brief 3134, Queue 1 Backup Register, Group 11 */
#define EVADC_G11_Q1_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0023134u)
/** Alias (User Manual Name) for EVADC_G11_Q1_QBUR.
* To use register names with standard convension, please use EVADC_G11_Q1_QBUR.
*/
#define EVADC_G11QBUR1 (EVADC_G11_Q1_QBUR)

/** \brief 3138, Queue 1 Requ. Timer Mode Reg., Group 11 */
#define EVADC_G11_Q1_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0023138u)
/** Alias (User Manual Name) for EVADC_G11_Q1_REQTM.
* To use register names with standard convension, please use EVADC_G11_Q1_REQTM.
*/
#define EVADC_G11REQTM1 (EVADC_G11_Q1_REQTM)

/** \brief 313C, Queue 1 Requ. Timer Status Reg., Group 11 */
#define EVADC_G11_Q1_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002313Cu)
/** Alias (User Manual Name) for EVADC_G11_Q1_REQTS.
* To use register names with standard convension, please use EVADC_G11_Q1_REQTS.
*/
#define EVADC_G11REQTS1 (EVADC_G11_Q1_REQTS)

/** \brief 3140, Queue 2 Source Contr. Register, Group 11 */
#define EVADC_G11_Q2_QCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QCTRL*)0xF0023140u)
/** Alias (User Manual Name) for EVADC_G11_Q2_QCTRL.
* To use register names with standard convension, please use EVADC_G11_Q2_QCTRL.
*/
#define EVADC_G11QCTRL2 (EVADC_G11_Q2_QCTRL)

/** \brief 3144, Queue 2 Mode Register, Group 11 */
#define EVADC_G11_Q2_QMR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QMR*)0xF0023144u)
/** Alias (User Manual Name) for EVADC_G11_Q2_QMR.
* To use register names with standard convension, please use EVADC_G11_Q2_QMR.
*/
#define EVADC_G11QMR2 (EVADC_G11_Q2_QMR)

/** \brief 3148, Queue 2 Status Register, Group 11 */
#define EVADC_G11_Q2_QSR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QSR*)0xF0023148u)
/** Alias (User Manual Name) for EVADC_G11_Q2_QSR.
* To use register names with standard convension, please use EVADC_G11_Q2_QSR.
*/
#define EVADC_G11QSR2 (EVADC_G11_Q2_QSR)

/** \brief 314C, Queue 2 Register 0, Group 11 */
#define EVADC_G11_Q2_Q0R /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_Q0R*)0xF002314Cu)
/** Alias (User Manual Name) for EVADC_G11_Q2_Q0R.
* To use register names with standard convension, please use EVADC_G11_Q2_Q0R.
*/
#define EVADC_G11Q0R2 (EVADC_G11_Q2_Q0R)

/** \brief 3150, Queue 2 Input Register, Group 11 */
#define EVADC_G11_Q2_QINR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QINR*)0xF0023150u)
/** Alias (User Manual Name) for EVADC_G11_Q2_QINR.
* To use register names with standard convension, please use EVADC_G11_Q2_QINR.
*/
#define EVADC_G11QINR2 (EVADC_G11_Q2_QINR)

/** \brief 3154, Queue 2 Backup Register, Group 11 */
#define EVADC_G11_Q2_QBUR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_QBUR*)0xF0023154u)
/** Alias (User Manual Name) for EVADC_G11_Q2_QBUR.
* To use register names with standard convension, please use EVADC_G11_Q2_QBUR.
*/
#define EVADC_G11QBUR2 (EVADC_G11_Q2_QBUR)

/** \brief 3158, Queue 2 Requ. Timer Mode Reg., Group 11 */
#define EVADC_G11_Q2_REQTM /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTM*)0xF0023158u)
/** Alias (User Manual Name) for EVADC_G11_Q2_REQTM.
* To use register names with standard convension, please use EVADC_G11_Q2_REQTM.
*/
#define EVADC_G11REQTM2 (EVADC_G11_Q2_REQTM)

/** \brief 315C, Queue 2 Requ. Timer Status Reg., Group 11 */
#define EVADC_G11_Q2_REQTS /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_Q_REQTS*)0xF002315Cu)
/** Alias (User Manual Name) for EVADC_G11_Q2_REQTS.
* To use register names with standard convension, please use EVADC_G11_Q2_REQTS.
*/
#define EVADC_G11REQTS2 (EVADC_G11_Q2_REQTS)

/** \brief 3180, Channel Event Flag Register, Group 11 */
#define EVADC_G11_CEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFLAG*)0xF0023180u)
/** Alias (User Manual Name) for EVADC_G11_CEFLAG.
* To use register names with standard convension, please use EVADC_G11_CEFLAG.
*/
#define EVADC_G11CEFLAG (EVADC_G11_CEFLAG)

/** \brief 3184, Result Event Flag Register, Group 11 */
#define EVADC_G11_REFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFLAG*)0xF0023184u)
/** Alias (User Manual Name) for EVADC_G11_REFLAG.
* To use register names with standard convension, please use EVADC_G11_REFLAG.
*/
#define EVADC_G11REFLAG (EVADC_G11_REFLAG)

/** \brief 3188, Source Event Flag Register, Group 11 */
#define EVADC_G11_SEFLAG /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_SEFLAG*)0xF0023188u)
/** Alias (User Manual Name) for EVADC_G11_SEFLAG.
* To use register names with standard convension, please use EVADC_G11_SEFLAG.
*/
#define EVADC_G11SEFLAG (EVADC_G11_SEFLAG)

/** \brief 3190, Channel Event Flag Clear Register, Group 11 */
#define EVADC_G11_CEFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_CEFCLR*)0xF0023190u)
/** Alias (User Manual Name) for EVADC_G11_CEFCLR.
* To use register names with standard convension, please use EVADC_G11_CEFCLR.
*/
#define EVADC_G11CEFCLR (EVADC_G11_CEFCLR)

/** \brief 3194, Result Event Flag Clear Register, Group 11 */
#define EVADC_G11_REFCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_REFCLR*)0xF0023194u)
/** Alias (User Manual Name) for EVADC_G11_REFCLR.
* To use register names with standard convension, please use EVADC_G11_REFCLR.
*/
#define EVADC_G11REFCLR (EVADC_G11_REFCLR)

